snlkuharlocal/src/Documents/УстановкаСкидок/УстановкаСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСкидок</name>
  <basedOn>Document.ЗаявкаНаСкидки</basedOn>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСкидок</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <comment>Дата окончания действия прайса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаСкидки</types>
    </type>
  </attributes>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/СкидкиНоменклатуры/СкидкиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СкидкиНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТипСкидок</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.УстановкаСкидок</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/УстановкаСкидок/ObjectModule.bsl
Перем НадоПерезаписыватьСкидки;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли; 
	
	НадоПерезаписыватьСкидки	= Ложь;
	ЕстьИзменения				= Модифицированность();
	
	Если НЕ ОбменДанными.Загрузка Тогда
		//КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		
		Если Отказ Тогда Возврат КонецЕсли;
		

	КонецЕсли;	
	
	Если НЕ ЕстьИзменения Тогда Возврат КонецЕсли;
	
	Если Дата<>Ссылка.Дата ИЛИ ТипСкидок<>Ссылка.ТипСкидок Тогда
		НадоПерезаписыватьСкидки=Истина;
	КонецЕсли;
	
	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли; 
	
	запрос=новый запрос("ВЫБРАТЬ
	                    |	аа.документ,
	                    |	аа.Скидка,
	                    |	аа.ТипСкидок,
	                    |	аа.Период,
	                    |	аа.ТипТовара,
	                    |	аа.Номенклатура,
	                    |	аа.Модель,
	                    |	аа.брэнд
	                    |ИЗ
	                    |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	                    |		&Документ КАК документ,
	                    |		СкидкиНоменклатуры.Скидка КАК Скидка,
	                    |		СкидкиНоменклатуры.ТипСкидок КАК ТипСкидок,
	                    |		СкидкиНоменклатуры.Период КАК Период,
	                    |		СкидкиНоменклатуры.ТипТовара КАК ТипТовара,
	                    |		ВложенныйЗапрос.Родитель КАК Номенклатура,
	                    |		ВложенныйЗапрос.Родитель.Родитель КАК Модель,
	                    |		ВложенныйЗапрос.Родитель.Родитель.Родитель КАК брэнд
	                    |	ИЗ
	                    |		РегистрСведений.СкидкиНоменклатуры КАК СкидкиНоменклатуры
	                    |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                    |				Номенклатура.Родитель КАК Родитель
	                    |			ИЗ
	                    |				Справочник.Номенклатура КАК Номенклатура
	                    |			ГДЕ
	                    |				(НЕ Номенклатура.ЭтоГруппа)) КАК ВложенныйЗапрос
	//крохин начало 01.03.2016
						//все уровни
	                    //|			ПО (СкидкиНоменклатуры.Номенклатура = ВложенныйЗапрос.Родитель.Родитель
	                    //|					ИЛИ СкидкиНоменклатуры.Номенклатура = ВложенныйЗапрос.Родитель.Родитель.Родитель)
						|ПО (СкидкиНоменклатуры.Номенклатура = ВложенныйЗапрос.Родитель.Родитель
	                    |					ИЛИ СкидкиНоменклатуры.Номенклатура = ВложенныйЗапрос.Родитель.Родитель.Родитель
						|                      ИЛИ СкидкиНоменклатуры.Номенклатура = ВложенныйЗапрос.Родитель.Родитель.Родитель.Родитель
						|                      ИЛИ СкидкиНоменклатуры.Номенклатура = ВложенныйЗапрос.Родитель.Родитель.Родитель.Родитель.Родитель)
						//крохин конец 01.03.2016
	                    |	ГДЕ
	                    |		СкидкиНоменклатуры.Документ = &Документ) КАК аа
	                    |ГДЕ
	                    |	(НЕ аа.Номенклатура В
	                    |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	                    |					СкидкиНоменклатуры.Номенклатура
	                    |				ИЗ
	                    |					РегистрСведений.СкидкиНоменклатуры КАК СкидкиНоменклатуры ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                    |							Номенклатура.Родитель КАК Родитель
	                    |						ИЗ
	                    |							Справочник.Номенклатура КАК Номенклатура
	                    |						ГДЕ
	                    |							(НЕ Номенклатура.ЭтоГруппа)
	                    |						) КАК ВложенныйЗапрос
	                    |						ПО
	                    |							СкидкиНоменклатуры.Номенклатура = ВложенныйЗапрос.Родитель
	                    |				ГДЕ
	                    |					СкидкиНоменклатуры.Документ = &Документ))
	                    |
	                    |ОБЪЕДИНИТЬ ВСЕ
	                    |
	                    |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                    |	&Документ,
	                    |	СкидкиНоменклатуры.Скидка,
	                    |	СкидкиНоменклатуры.ТипСкидок,
	                    |	СкидкиНоменклатуры.Период,
	                    |	СкидкиНоменклатуры.ТипТовара,
	                    |	СкидкиНоменклатуры.Номенклатура,
	                    |	СкидкиНоменклатуры.Модель,
	                    |	СкидкиНоменклатуры.Брэнд
	                    |ИЗ
	                    |	РегистрСведений.СкидкиНоменклатуры КАК СкидкиНоменклатуры
	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                    |			Номенклатура.Родитель КАК Родитель
	                    |		ИЗ
	                    |			Справочник.Номенклатура КАК Номенклатура
	                    |		ГДЕ
	                    |			(НЕ Номенклатура.ЭтоГруппа)) КАК ВложенныйЗапрос
	                    |		ПО СкидкиНоменклатуры.Номенклатура = ВложенныйЗапрос.Родитель
	                    |ГДЕ
	                    |	СкидкиНоменклатуры.Документ = &Документ");
						запрос.УстановитьПараметр("Документ",ссылка);
											
						
		выб=запрос.Выполнить().Выбрать();
	

		НаборЗаписей		=РегистрыСведений.СкидкиНоменклатуры.СоздатьНаборЗаписей();
		//НаборЗаписей.Отбор.Период.Установить(НачалоДня(Дата));
		//НаборЗаписей.Отбор.ТипСкидок.Установить(ТипСкидок);
		НаборЗаписей.Отбор.Документ.Установить(ссылка);
		
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		//НаборЗаписей.Записать();
		
		
		пока выб.Следующий() цикл
			нов=наборзаписей.Добавить();
			ЗаполнитьЗначенияСвойств(нов,выб);
		Конеццикла;
		

		НаборЗаписей.записать();
	
		//		спис=новый списокЗначений;
		//для каждого стр из НаборЗаписей цикл
		//	если  НЕ (ВернутьТипГруппыНоменклатуры(стр.Номенклатура)="Модель" или стр.Номенклатура.ЭтоГруппа) тогда
		//		Спис.Добавить(стр.Номенклатура);
		//	иначе
		//		нов=тз.Добавить();
		//		заполнитьзначениясвойств(нов,стр);
		//	Конецесли;
		//Конеццикла;
		//
		//запрос=новый Запрос("ВЫБРАТЬ
		//					|	СкидкиНоменклатуры.Скидка,
		//					|	СкидкиНоменклатуры.ТипСкидок,
		//					|	СкидкиНоменклатуры.Период,
		//					|	СкидкиНоменклатуры.Номенклатура КАК Номенклатура,
		//					|	СкидкиНоменклатуры.ТипТовара
		//					|ИЗ
		//					|	РегистрСведений.СкидкиНоменклатуры КАК СкидкиНоменклатуры
		//					|ГДЕ
		//					|	СкидкиНоменклатуры.Документ = &Документ
		//					|ИТОГИ ПО
		//					|	Номенклатура ИЕРАРХИЯ");
		//					
		//		Запрос.УстановитьПараметр("Спис",Спис);
		//		
		//		выб=запрос.Выполнить().Выбрать();
		//		пока выб.Следующий() цикл
		//			Если тз.Найти("Номенклатура",выб.модель)=НЕОПРЕДЕЛЕНО тогда
		//				нов=тз.Добавить();
		//				
		//			Конецесли;	
		//		Конеццикла;	
		//		
		//		
		//	 нов=тз.Добавить();
		//	 нов.номенклатура=стр.Номенклатура;
		//	 нов.скидка=стр.Скидка;
		//Конеццикла;

	//	
	//	КэшСкидок.Вставить(Номенклатура,Ложь);
	//Иначе
	//	Запись				=РегистрыСведений.СкидкиНоменклатуры.СоздатьМенеджерЗаписи();
	//	Запись.Период		=Дата;
	//	Запись.ТипСкидок	=ТипСкидок;
	//	Запись.Номенклатура	=Номенклатура;
	//
	//	Уровень=Номенклатура.Уровень();
	//	Если Уровень=0 Тогда
	//		Запись.ТипТовара=Номенклатура;			
	//	ИначеЕсли Уровень=1 Тогда
	//		Запись.ТипТовара=Номенклатура.Родитель;			
	//		Запись.Брэнд	=Номенклатура;			
	//	ИначеЕсли Уровень=2 Тогда
	//		Запись.ТипТовара=Номенклатура.Родитель.Родитель;
	//		Запись.Брэнд	=Номенклатура.Родитель;
	//		Запись.Модель	=Номенклатура;
	//	ИначеЕсли Уровень=3 Тогда
	//		Запись.ТипТовара=Номенклатура.Родитель.Родитель.Родитель;
	//		Запись.Брэнд	=Номенклатура.Родитель.Родитель;
	//		Запись.Модель	=Номенклатура.Родитель;		
	//	КонецЕсли;
	//	
	//	Запись.Документ		=Ссылка;
	//	Запись.Скидка		=Элемент.Значение;
	//	
	//	Запись.Записать();	
	//	
	//	КэшСкидок.Вставить(Номенклатура,Элемент.Значение);
	//КонецЕсли;	
	//
	//ЭлементыФормы.НоменклатураСписок.ЗакончитьРедактированиеСтроки(Истина);		

	
	Если НадоПерезаписыватьСкидки Тогда
		Набор=РегистрыСведений.СкидкиНОменклатуры.СоздатьНаборЗаписей();
		Набор.Отбор.Документ.Установить(Ссылка);
		Набор.Прочитать();
		
		ВсегоЗаписей=Набор.Количество();
		
		Для Каждого Запись Из Набор Цикл 
			#ЕСЛИ КЛИЕНТ ТОГДА
			Состояние("Осталось: "+ВсегоЗаписей);
			#КОНЕЦЕСЛИ
			
			ВсегоЗаписей=ВсегоЗаписей-1;
			
			Если Запись.Период<>НачалоДня(Дата) Тогда
				Запись.Период=Дата;		
			КонецЕсли;		
			Если Запись.ТипСкидок<>ТипСкидок Тогда
				Запись.ТипСкидок=ТипСкидок;		
			КонецЕсли; 
		КонецЦикла;	
		Если Набор.Модифицированность() Тогда
			Набор.Записать();	
		КонецЕсли;				
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда Возврат; КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаСкидки") Тогда
		
		ДокОснование = ДанныеЗаполнения;
		Автор = ПараметрыСеанса.Пользователь;
		
		МассивПолей = Новый Массив;
		МассивПолей.Добавить("Дата");
		МассивПолей.Добавить("Комментарий");
		
		ЗначенияРеквизитовОснования = ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, СтрСоединить(МассивПолей, ","));
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначенияРеквизитовОснования);
		
		Валюта = Константы.НациональнаяВалюта.Получить();
		Курс = ПолучитьКурсВалюты_ПоРусски(Валюта, Дата);
		
		Организация = Справочники.Организации.НайтиПоКоду("SS-001");
        ИБ = Справочники.ИБ.НайтиПоКоду("SSP");
		
		Дата2 = Дата;
		
		ТипСкидок = ?(ЗначениеЗаполнено(ДанныеЗаполнения.Подразделение), ДанныеЗаполнения.Подразделение.РозничныйТипСкидок, ДанныеЗаполнения.ТипСкидок);
		
	КонецЕсли;

КонецПроцедуры
